; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 160962 2 2 2 4 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	thermograph0 - mode
	thermograph1 - mode
	Star0 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon4)
	(supports instrument2 thermograph1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
)
(:goal (and
	(pointing satellite0 GroundStation3)
	(have_image Phenomenon4 thermograph0)
	(have_image Phenomenon5 thermograph1)
	(have_image Planet6 thermograph0)
	(have_image Star7 thermograph1)
	(have_image Phenomenon8 thermograph1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 6
3. (turn_to satellite0 groundstation3 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 groundstation3)
   goals met: 1 of 6
4. (turn_to satellite1 groundstation1 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 groundstation1)
   goals met: 1 of 6
5. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 1 of 6
6. (turn_to satellite0 planet6 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet6)
   goals met: 0 of 6
7. (turn_to satellite1 star7 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star7)
   goals met: 0 of 6
8. (turn_to satellite0 phenomenon8 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon8)
   goals met: 0 of 6
9. (take_image satellite1 star7 instrument2 thermograph1)
   added: (have_image star7 thermograph1)
   goals met: 1 of 6
10. (turn_to satellite0 phenomenon5 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon5)
   goals met: 1 of 6
11. (turn_to satellite1 planet6 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet6)
   goals met: 1 of 6
12. (turn_to satellite0 phenomenon4 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon4)
   goals met: 1 of 6
13. (take_image satellite1 planet6 instrument2 thermograph0)
   added: (have_image planet6 thermograph0)
   goals met: 2 of 6
14. (turn_to satellite0 phenomenon5 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 phenomenon5)
   goals met: 2 of 6
15. (turn_to satellite1 phenomenon8 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 phenomenon8)
   goals met: 2 of 6
16. (turn_to satellite0 phenomenon4 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon4)
   goals met: 2 of 6
17. (take_image satellite1 phenomenon8 instrument2 thermograph1)
   added: (have_image phenomenon8 thermograph1)
   goals met: 3 of 6
18. (turn_to satellite0 groundstation1 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 groundstation1)
   goals met: 3 of 6
19. (turn_to satellite1 phenomenon5 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon5)
   goals met: 3 of 6
20. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 3 of 6
21. (take_image satellite1 phenomenon5 instrument2 thermograph1)
   added: (have_image phenomenon5 thermograph1)
   goals met: 4 of 6
22. (turn_to satellite0 groundstation3 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 groundstation3)
   goals met: 5 of 6
23. (turn_to satellite1 phenomenon4 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon4)
   goals met: 5 of 6
24. (take_image satellite1 phenomenon4 instrument2 thermograph0)
   added: (have_image phenomenon4 thermograph0)
   goals met: 6 of 6
